In [6]:
import pandas as pd

df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Name': ['Alice', 'Bob', 'Charlie'],
                    'Age': [25, 30, 35]})

df2 = pd.DataFrame({'ID': [1, 2, 4],
                    'Salary': [50000, 60000, 70000]})

In [8]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35

In [10]:
df2

   ID  Salary
0   1   50000
1   2   60000
2   4   70000

In [12]:

merged_df = pd.merge(df1, df2, on='ID')
merged_df

   ID   Name  Age  Salary
0   1  Alice   25   50000
1   2    Bob   30   60000